Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.StructAnalyticalErrorProjection Property
 Can't project Analytical Model to Analytical Projection Surface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructAnalyticalErrorProjection { get; }
Public Shared ReadOnly Property StructAnalyticalErrorProjection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructAnalyticalErrorProjection {
	FailureDefinitionId^ get ();
}
static member StructAnalyticalErrorProjection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace